In [1]:
import numpy as np
import pandas as pd

# 텍스트 파일에서 데이터를 읽고 쓰는 법

In [3]:
df = pd.read_csv("pydata-book-2nd-edition\examples\ex1.csv")

In [4]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
df = pd.read_table("pydata-book-2nd-edition\examples\ex1.csv", sep = ',')

In [6]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
pd.read_csv("pydata-book-2nd-edition\examples\ex2.csv", names = ['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
names = ['a','b','c','d','message']

In [11]:
pd.read_csv('pydata-book-2nd-edition\examples\ex2.csv', names = names, index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [12]:
parsed = pd.read_csv("pydata-book-2nd-edition\examples\csv_mindex.csv", index_col = ['key1','key2'])

In [13]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [14]:
list(open("pydata-book-2nd-edition\examples\ex3.txt"))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [6]:
result = pd.read_table("pydata-book-2nd-edition\examples\ex3.txt", sep = '\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [10]:
pd.read_csv("pydata-book-2nd-edition\examples\ex4.csv", skiprows = [0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [17]:
result = pd.read_csv('pydata-book-2nd-edition/examples/ex5.csv')
result
# pd.isnull(result)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [16]:
result = pd.read_csv('pydata-book-2nd-edition/examples/ex5.csv', na_values = ['NULL']) # na_values = NA값으로 처리할 목록
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [18]:
sentinels = {'message':['foo','NA'], 'someting':['two']}
result = pd.read_csv('pydata-book-2nd-edition/examples/ex5.csv', na_values = sentinels)
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [19]:
result = pd.read_csv('pydata-book-2nd-edition/examples/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [20]:
result.head()

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

## 데이터를 텍스트 형식으로 기록하기

In [21]:
import sys

In [24]:
dates = pd.date_range('1/1/2000', periods = 7)
ts = pd.Series(np.arange(7), index = dates)

In [26]:
ts.to_csv("pydata-book-2nd-edition/examples/tseries.csv")

## 구분자 형식 다루기

In [27]:
import csv

In [39]:
f = open('pydata-book-2nd-edition/examples/ex7.csv')
reader = csv.reader(f)

In [31]:
reader

In [32]:
for line in reader :
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [34]:
with open('pydata-book-2nd-edition/examples/ex7.csv') as f :
    lines = list(csv.reader(f))

In [35]:
header, values = lines[0], lines[1:]

In [36]:
data_dict = {h:v for h, v in zip(header, zip(*values))}

In [37]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [38]:
reader = csv.reader(f, delimiter = '|')

TypeError: argument 1 must be an iterator

## JSON 데이터

In [40]:
import json

In [42]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [43]:
result = json.loads(obj)

In [44]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [45]:
asjson = json.dumps(result)

In [46]:
siblings = pd.DataFrame(result['siblings'], columns = ['name','age'])

In [47]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [48]:
data= pd.read_json('pydata-book-2nd-edition/examples/example.json')

In [49]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

## XML과 HTML 웹 프로그래밍

In [51]:
tables = pd.read_html('pydata-book-2nd-edition/examples/fdic_failed_bank_list.html')

In [52]:
tables

[                             Bank Name             City  ST   CERT  \
 0                          Allied Bank         Mulberry  AR     91
 1         The Woodbury Banking Company         Woodbury  GA  11297
 2               First CornerStone Bank  King of Prussia  PA  35312
 3                   Trust Company Bank          Memphis  TN   9956
 4           North Milwaukee State Bank        Milwaukee  WI  20364
 ..                                 ...              ...  ..    ...
 542                 Superior Bank, FSB         Hinsdale  IL  32646
 543                Malta National Bank            Malta  OH   6629
 544    First Alliance Bank & Trust Co.       Manchester  NH  34264
 545  National State Bank of Metropolis       Metropolis  IL   3815
 546                   Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 ..                                   ...                 ...
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

           Updated Date
 0    November 17, 2016
 1    November 17, 2016
 2    September 6, 2016
 3    September 6, 2016
 4        June 16, 2016
 ..                 ...
 542    August 19, 2014
 543  November 18, 2002
 544  February 18, 2003
 545     March 17, 2005
 546     March 17, 2005

 [547 rows x 7 columns]]

In [53]:
failures = tables[0]

In [54]:
failures

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"
...,...,...,...,...,...,...,...
542,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
543,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
544,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
545,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
546,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [55]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [58]:
close_timestamps.dt.year.value_counts().sort_index()

2000      2
2001      4
2002     11
2003      3
2004      4
2007      3
2008     25
2009    140
2010    157
2011     92
2012     51
2013     24
2014     18
2015      8
2016      5
Name: Closing Date, dtype: int64

In [59]:
from lxml import objectify
path = 'pydata-book-2nd-edition/datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [60]:
data = []

In [61]:
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
               'DESIRED_CHANGE', 'DECIMAL_PLACES']

In [62]:
for elt in root.INDICATOR :
    el_data = {}
    for child in elt.getchildren() :
        if child.tag in skip_fields :
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [63]:
perf = pd.DataFrame(data)
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95,96.9,95,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95,96,95,95
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95,96.3,95,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95,96.8,95,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95,96.6,95,95.8

In [64]:
from io import StringIO

In [65]:
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [66]:
root

In [67]:
root.get('href')

'http://www.google.com'

In [69]:
root.text

'Google'

# 이진 데이터 형식
* pickle 데이터 직렬화

In [70]:
frame = pd.read_csv("pydata-book-2nd-edition/examples/ex1.csv")

In [73]:
frame.to_pickle("pydata-book-2nd-edition/examples/frame_pickle")

In [74]:
pd.read_pickle("pydata-book-2nd-edition/examples/frame_pickle")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

## HDF5 형식 사용하기

In [75]:
frame = pd.DataFrame({'a':np.random.randn(100)})

In [76]:
store = pd.HDFStore('mydata.h5')

In [77]:
store['obj1'] = frame

In [78]:
store['obj1_col']  = frame['a']

In [79]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [80]:
store['obj1']

           a
0   0.436849
1  -0.916475
2  -0.251968
3   0.292519
4   0.027223
..       ...
95 -0.272867
96 -1.789042
97  0.476776
98  0.713370
99 -0.080116

[100 rows x 1 columns]

In [81]:
store['obj1_col']

0     0.436849
1    -0.916475
2    -0.251968
3     0.292519
4     0.027223
        ...
95   -0.272867
96   -1.789042
97    0.476776
98    0.713370
99   -0.080116
Name: a, Length: 100, dtype: float64

## 마이크로소프트 엑셀 파일에서 데이터 읽어오기

In [82]:
xlsx = pd.ExcelFile("pydata-book-2nd-edition/examples/ex1.xlsx")

In [86]:
frame = pd.read_excel("pydata-book-2nd-edition/examples/ex1.xlsx", 'Sheet1')

In [87]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [88]:
frame.to_excel('pydata-book-2nd-edition/examples/ex2.xlsx')

# 웹 API와 함께 사용하기
* requests 라이브러리 이용

In [89]:
import requests

In [90]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [91]:
data = resp.json()

In [94]:
data[0]['title']

'Backport PR #43809 on branch 1.3.x (DOC: Add link to previous versions documentation)'

In [95]:
issues = pd.DataFrame(data, columns = ['number','title','labels','state'])

In [96]:
issues

,number,title,labels,state
0,43816,Backport PR #43809 on branch 1.3.x (DOC: Add l...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
1,43815,BUG: Printing DataFrame in Jupyter Notebook mo...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
2,43814,Using `.loc` with MultiIndex containing `np.na...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
3,43813,Multiindex drop doc improvement,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
4,43812,CI/TYP: set python_version for mypy,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
5,43807,TYP: mypy complaint isocalendar does not match...,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
6,43806,TYP: GroupBy,[],open
7,43805,PERF: improve perf of conversion to string arrays,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
8,43804,BUG: Incompatible versions in resolved depende...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
9,43802,REG: Regression in explode when column is non ...,"[{'id': 13098779, 'node_id': 'MDU6TGFiZWwxMzA5...",open
10,43801,DOC: Add cross merge to userguide section,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
11,43799,CI/TYP: run pyright at manual stage in pre-commit,[],open
12,43798,BUG: python engine in pd.read_csv fails to par...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
13,43797,BUG: DataFrame resample fails across daylight ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
14,43795,ENH:,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
15,43794,how to merge on one column while keeping index?,"[{'id': 307649777, 'node_id': 'MDU6TGFiZWwzMDc...",open
16,43793,ENH: Drop Index Combinations from Multiindex D...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
17,43791,BUG: pandas.to_datetime raises exception when ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
18,43790,TYP: enable reportMissingImports,[],open
19,43787,[PERF] Improve performace of read_csv with mem...,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
20,43785,BUG: Merge with str/StringDtype keys and multi...,"[{'id': 13098779, 'node_id': 'MDU6TGFiZWwxMzA5...",open
21,43784,BUG: DatetimeIndex and Timestamp behave incons...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
22,43783,DOC: to_sql and extending pandas,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
23,43781,QST: Is there a function in pandas to do this ...,"[{'id': 34444536, 'node_id': 'MDU6TGFiZWwzNDQ0...",open
24,43780,BUG: Selecting multiple columns from data fram...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
25,43779,Fixed broken import in assert_frame_equal docs...,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
26,43778,DOC: Broken import in snippet (pandas.testing....,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
27,43776,TYP: enable reportUntypedNamedTuple,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
28,43774,CLN: unify fused type definitions,"[{'id': 49094459, 'node_id': 'MDU6TGFiZWw0OTA5...",open
29,43773,ENH:,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open

# 데이터베이스와 함께 사용하기

In [97]:
import sqlite3

In [98]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""
con = sqlite3.connect('mydata.sqlite')
con.execute(query)
con.commit()

In [99]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [100]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [101]:
cursor.description
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [102]:
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5